app/controllers/users_controller.rb

INSERT INTO "users" ("bio", "created_at", "email", "name", "surname", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["bio", "deneme"], ["created_at", "2014-08-19 17:16:24.665644"], ["email", "deneme"], ["name", "deneme"], ["surname", "deneme"], ["updated_at", "2014-08-19 17:16:24.665644"]]
---
  def create
    @user = User.new(user_params)

    @user.save